var x = 6, y = 14, z =4 ;
console.log(x += y - x++ * z );
/*
1.+= це Оператор присвоєння з додаванням
2. - це Оператор віднімання або зміни знака
3. ++ це Оператор Префиксный инкремент  спочатку повертає поточне значення змінної, а потім збільшує її
4. * це Оператор Використовується для множення чисел, а також має додаткові функції в інших контекстах

*/
var x = 6, y = 14, z =4 ;
console.log(z = --x - y * 5) ;
/*
1.= це Оператор  присвоєння значення змінній
2.--x це Оператор  э префіксним декрементом означає, що значення змінної x спочатку зменшується на 1, а потім використовується в обчисленнях
3.- це Оператор віднімання або зміни знака
4.* це Оператор Використовується для множення чисел, а також має додаткові функції в інших контекстах
*/
var x = 6, y = 14, z =4 ;
console.log(y /= x + 5 % z) ;
/*
1./ це Оператор э скороченим записом операції ділення та присвоєння. Він означає, що змінна ділиться на певне значення, і результат одразу зберігається у ній
2.--x це Оператор  э префіксним декрементом означає, що значення змінної x спочатку зменшується на 1, а потім використовується в обчисленнях
3.+ це Оператор є універсальним і дуже часто використовується в математичних обчисленнях та роботі з текстом
4.% це Оператор використовується для обчислення залишку від ділення двох чисел
*/
var x = 6, y = 14, z =4 ;
console.log(z - x++ + y * 5) ;
/*
1.- це Оператор віднімання або зміни знака
2.x++ це Оператор  постфіксним інкрементом. Він збільшує значення x на 1, але повертає старе значення перед збільшенням
3.+ це Оператор використовується для додавання чисел та конкатенації рядків є універсальним і дуже часто використовується в математичних обчисленнях та роботі з текстом 
4.* це Оператор Використовується для множення чисел, а також має додаткові функції в інших контекстах
*/
 var x = 6, y = 14, z =4 ;
console.log(x = y - x++ * z);
/*
1.= це Оператор  присвоєння значення змінній
2.- це Оператор віднімання або зміни знака
3.+ це Оператор використовується для додавання чисел та конкатенації рядків є універсальним і дуже часто використовується в математичних обчисленнях та роботі з текстом 
4.* це Оператор Використовується для множення чисел, а також має додаткові функції в інших контекстах
5.x++ це Оператор  постфіксним інкрементом. Він збільшує значення x на 1, але повертає старе значення перед збільшенням
6.x++ * це Якщо вони з'являються разом у виразі, це може мати кілька значень залежно від розташування та контексту
*/
